app/controllers/operations_controller.rb

  def index
    @operations = Operation.all.with_attached_image
---
SELECT "operations".* FROM "operations"

  def create
    @newOperation = Operation.new(operation_params)
    if @newOperation.save
      @newOperation.image.attach(operation_params[:image])
---
INSERT INTO "operations" ("name", "amount", "description", "date_of_expense", "priority", "category", "type_of_operation", "wallet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @operation.update(operation_params)
    if @operation.save
---
UPDATE "operations" SET "priority" = $1, "amount" = $2, "date_of_expense" = $3, "wallet_id" = $4, "updated_at" = $5 WHERE "operations"."id" = $6  [["priority", "Low"], ["amount", 45], ["date_of_expense", "2019-06-05"], ["wallet_id", 3], ["updated_at", "2019-06-05 19:37:51.662795"], ["id", 13]]
UPDATE "operations" SET "name" = $1, "updated_at" = $2 WHERE "operations"."id" = $3  [["name", "Hello my friend"], ["updated_at", "2019-06-06 14:50:17.094674"], ["id", 24]]

  def destroy
    if @operation.destroy
---
DELETE FROM "operations" WHERE "operations"."id" = $1  [["id", 21]]

  def get_operation
    @operation = Operation.find(params[:id])
---
SELECT  "operations".* FROM "operations" WHERE "operations"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]