app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets"
---
  def index
    @wallets = Wallet.all

INSERT INTO "wallets" ("name", "currency", "limit", "cash_or_credit", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @newWallet =  Wallet.new(wallet_params)
    if @newWallet.save